## 더미 데이터
INSERT INTO sweetener (sweetener_name, sweetener_description, sweetener_status) VALUES
('수크랄로스', '일일 적정 섭취량(ADI): 체중 1kg당 200mg\n설탕의 600배의 단맛을 내요.많이 섭취해도 설사 등의 부작용이 거의 없어 대체당 용도로 많이 사용돼요. 설탕과 비교했을 때 훨씬 적은 양으로 단 맛을 낼 수 있어 충치와 비만의 위험을 줄여요.\n다만, 설탕이나 탄수화물과 동시에 섭취할 경우 단맛에 대한 말초.중추 감도가 감소하여 인슐린 감수성이 저하되고, 이로 인해 2형 당뇨가 발생할 수 있다는 연구가 있어요.\n따라서 제품에 설탕이나 탄수화물이 함께 포함되었다면 섭취에 유의하는 것이 좋아요.', 'GOOD'),
('스테비올배당체', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 약 300배의 단맛을 내요. 디저트, 청량음료, 어묵, 간장, 커피믹스, 주류 등에 많이 사용되나 영유아 식품에는 허용하지 않고 있어요. 과다 섭취 시 복부팽만이나 설사와 같은 부작용이 있으니 주의하세요.', 'BAD'),
('아세설팜칼륨', '일일 적정 섭취량(ADI): 체중 1kg당 200mg\n설탕의 200배의 단맛을 내요.무열량 감미료로 과자, 아이스크림, 음료에 많이 사용돼요.', 'GOOD'),
('아스파탐', '일일 적정 섭취량(ADI): 체중 1kg당 40mg\n설탕의 200배의 단맛을 내요. 160도 이상을 가하면 분해되어 단맛을 잃어버린다는 특징이 있어요. 국내 저가 주류에 많이 사용되며, 뮤탄스균(충치균)을 분해하지 못해 충치를 유발하지 않아요.', 'GOOD'),
('에리스리톨(에리트리톨)', '일일 적정 섭취량(ADI): 데이터가 부족해요\n당알코올의 한 종류. 설탕 5숟갈, 에리스리톨 7숟갈. 청량감이 난다.\n열로 인해 단맛이 변하지 않음.\n제로칼로리 음료에 심심찮게 들어가고 혈당이 거의 오르지 않음. 충취위협도 x. 90% 이상이 소변으로 배출. 나머지는 대장에서 미생물 작용으로 소모됨. 때문에 0칼로리 감미료로 취급함.\n다만 당알코올 특성상 많이 먹으면 안 되고, 하루에 50그램 이하로 섭취하는 것이 좋다.\n부작용 : 속이 더부룩하고 소화가 잘 되지 않음. 설사를 일으킴.', 'BAD'),
('이소말트(아이소말트)', '일일 적정 섭취량(ADI): 책정되어있지 않아요.\n설탕의 0.45배 단맛을 내요. 설탕과 비슷한 맛이 나며 뒷맛이 없고 산뜻하다는 특징이 있어요. 설탕보다 열량이 낮고, 설사를 유발하는 경우가 적어 과자, 껌, 청량음료 등에 설탕 대체품으로 사용돼요. 다만, 하루에 20~30g 섭취하는 사람에게 설사를 유발시킨다는 연구 보고가 있어요.', 'BAD'),
('D-자일로오스', '일일 적정 섭취량(ADI): 데이터가 부족해요\n인체에 소화되지 않는 당류로 기능하며 저칼로리 감미료로 활용돼요. 자일리톨이라는 감미료의 생상원료로 사용되기도 해요.', 'GOOD'),
('자일리톨', '일일 적정 섭취량(ADI): 데이터가 부족해요\n충치의 원인이 되는 산을 형성하지 않는 천연 소재의 감미료예요. 의료용으로 당뇨 환자에게 포도당 대용으로 에너지 보급 목적으로 사용하기도 해요.', 'GOOD'),
('토마틴', '데이터가 부족해요', 'NEUTRAL'),
('폴리글리시톨시럽', '데이터가 부족해요', 'NEUTRAL'),
('효소처리스테비아', '데이터가 부족해요', 'NEUTRAL'),
('감초추출물', '일일 적정 섭취량(ADI): 데이터가 부족해요\n감초 뿌리에서 추출한 천연 감미료로, 설탕의 200배 단맛을 내요. 감미에 지속성이 있다는 특징이 있습니어요. 강력한 항바이러스 및 항균 특성을 가지고 있어, 다양한 유형의 감염을 예방하고 치료하는데 효과적이에요. 다만 과도하게 섭취 시, 혈압을 상승시킬 수 있으므로, 고혈압환자들은 주의해야해요.', 'GOOD'),
('글리실리진산이나트륨', '일일 적정 섭취량(ADI): 데이터가 부족해요\n식물에서 추출한 천연감미료로, 설탕보다 약 200배 지속성을 가지고 있어요. 우리나라에서는 간장과 된장에서만 사용할 수 있어요.', 'GOOD'),
('만니톨', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 절반 정도 단맛을 내요. 당뇨병 환자를 위한 감미료로 쓰이며, 인체의 물의 흡수를 방해하는 역할을 하기 때문에 이뇨제로도 사용돼요. 많은 에너지 바와 스낵은 설탕 대신 만니톨 분말을 감미료로 사용합니다. 과다 섭취 시 복통 및 변비, 설사와 같은 위장 문제를 일으킬 수 있습니다.', 'BAD'),
('D-리보오스', '일일 적정 섭취량(ADI): 데이터가 부족해요\n격한 운동 후 피로감소 및 손상된 근육의 회복, 심장의 기능을 향상시키는 효과가 밝혀져 건강기능 보충제로 이용되고 있어요.', 'NEUTRAL'),
('사카린나트륨', '일일 적정 섭취량(ADI): 체중 1kg당 5mg\n설탕의 500배의 단맛을 내지만 열량이 전혀 없어요. 1980년대 발암물질로 의혹을 받았으나 2010년 미국 식품의약국(FDA, Food and Drug Administration)에서 안전성을 공식 인정받았으며 국내에서도 현재 식품첨가물로 허용되어 있여요. 다만, 췌장에서 인슐린 생산 등 내분비 반응을 자극할 수 있으며 일부 알레르기 반응이 나타날 수 있어요. 시판용 감미료에는 설탕과 혼합되어 있는 제품이 많으므로 확인이 필요해요.', 'BAD'),
('네오탐', '일일 적정 섭취량(ADI): 체중 1kg당 0~2mg\n설탕보다 약 7000-13000배 단맛이 강하며, 칼로리가 거의 없어요. 다만, 피부 발진, 발진, 가려움증, 두드러기 등의 알레르기를 유발할 수 있는 가능성이 있어요. 매우 강력한 감미료로, 과도한 섭취로 인해 당의 섭취 욕구를 증가시킬 수 있어 유의해야해요.', 'BAD'),
('말티톨시럽', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 30~75%단 맛이 나는 액체 형태의 대체 감미료예요. 다른 당알코올들은 뒷맛이 화하지만, 말티톨은 이러한 맛을 무시해도 될 정도로 적어요. 말티톨은 적은 양만이 체내로 흡수되고, 70~90%는 체외로 배출돼요. 또한, 충치를 유발하지 않아요.\n다만, 과다 섭취 시 복통 및 변비, 설사와 같은 위장 문제를 일으킬 수 있습니다.', 'BAD'),
('락티톨', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 80% 정도 단 맛을 내요. 설탕의 절반 정도의 칼로리를 가지고 있어요. 산을 만들어 내지 않아 충치를 유발하지 않아요. 다만, 과다 섭취 시 복통 및 변비, 설사와 같은 위장 문제를 일으킬 수 있으니 주의하세요.', 'BAD'),
('D-말티톨', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕보다 약 75~90%의 단 맛을 내요. 칼로리는 설탕의 절반 정도예요. 당이 체내 흡수되는 정도(혈당지수)가 설탕의 절반 정도이기 때문에 인기있는 대체감미료예요.\n혈당과 인슐린을 급속하게 상승시키지 않기 때문에 당뇨병 환자들의 감미료로 많이 사용되기도 해요.\n다만, 과다 섭취 시 복통 및 변비, 설사와 같은 위장 문제를 일으킬 수 있어요.', 'BAD'),
('D-소비톨(D-소르비톨)', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 약 60%의 단맛을 가지며, 칼로리가 낮아요.\n당이 체내 흡수되는 정도(혈당지수)가 설탕의 절반 정도이기 때문에 인기있는 대체감미료입니다.\n혈당과 인슐린을 급속하게 상승시키지 않기 때문에 당뇨병 환자들의 감미료로 많이 사용됩니다.\n구강 내 세균의 이용성이 떨어져 충치 예방에 좋습니다.\n하루에 50g이상 섭취하면 복통과 설사가 발생할 수 있으므로, 적절한 양을 섭취해야합니다.\n알레르기 주의: D-소비톨에 알레르기가 있는 사람들은 피부 발진, 가려움, 붓기, 호흡 곤란, 혈압 하락 등의 증상을 경험할 수 있어요.', 'BAD'),
('D-소비톨액', '일일 적정 섭취량(ADI): 데이터가 부족해요\n설탕의 60%의 단맛을 가지지만, 열량은 설탕의 절반 정도로 낮아요. 설탕 대체제로 인기를 얻고 있어요. 사과, 배, 복숭아를 포함한 다양한 과일에서 자연적으로 발생해요.\nD-소비톨액은 당 알코올의 한 종류예요. 사람은 당 알코올을 소화할 수 있는 효소가 없어 장 내에 미생물에 의해 발효가 돼요. 그러다 보면 장에 오래 머물게 되고, 이것이 삼투압을 유발해 주변을 끌어들이면서 설사나 복통을 유발하게 돼요. (실제로 말티톨 시럽,D-소비톨, D-소비톨 액에 들어간 무설탕 젤리 제품을 먹고 복통과 설사에 시달려서 제품 회수했던 사례 있음)\n다만, 혈당 수준에 영향을 줄 수 있으므로 당뇨병 환자의 경우에는 섭취 시 전문가와 상담이 필요해요. 일부 사람의 경우 소비톨액에 대해 알레르기 반응이 나올 수도 있으니 섭취에 유의해야해요.', 'BAD');


-- 더미 데이터 삽입
INSERT INTO article (title, summary, date, author, content, hash_tag, views, likes, thumbnail)
VALUES
    ('제로마케팅, 이것 뭐예요?',
     '제로 칼로리 음료와 제로 식품의 인기와 주의사항.',
     '2023-08-01 00:00:00',
     '김정목',
     '최근 몇 년간 제로 칼로리 음료와 제로 식품이 소비자들 사이에서 큰 인기를 끌고 있어요. ‘제로마케팅’이라는 용어도 등장하며, 소비자들은 칼로리를 걱정하지 않고 맛을 즐길 수 있는 이 제품들에 열광하고 있습니다. 그렇다면 제로마케팅이란 무엇일까요? 그리고 이러한 제품들이 정말로 안전하고 건강에 좋을까요? 제로 제품의 숨겨진 진실과 소비자들이 꼭 알아야 할 주의 사항들을 지금 바로 알아보아요. 제로 식품에서 제로는 ‘제로 슈거’나 ‘제로 칼로리’를 지칭해요. 이러한 제품들은 주로 인공감미료를 사용해 당분을 대체하며, 그 결과로 칼로리 섭취를 줄일 수 있어요. 대표적인 인공감미료로는 아스파탐, 수크랄로스, 스테비아 등이 있지요. 이들 감미료는 설탕보다 단맛이 강해 소량으로도 충분한 단맛을 낼 수 있답니다. 또한, 설탕 대신 들어가는 인공감미료에 대한 장기적인 연구는 아직 진행 중이며, 일부 연구에서는 과다 섭취 시 건강에 해로울 수 있다는 결과도 나왔어요. 예를 들어, 아스파탐은 일부 사람들에게 두통을 유발할 수 있으며, 수크랄로스는 장내 미생물 균형에 영향을 줄 수 있다는 연구 결과도 있답니다. 중요한 것은 일부 제품은 당 함량이 0g이 아님에도 불구하고 ‘제로’라는 이름을 내세워 마케팅하고 있어요. 식품 표시 기준에 따르면 100mL 당 5kcal 미만이면 ‘0’으로 표기할 수 있어요. ‘0’이라고 해서 방심하고 과다 섭취를 하면 안 되는 이유이기도 합니다. 제로 음료와 식품은 분명 칼로리를 줄이는 데 도움이 될 수 있지만, 과신해서는 안 돼요. 제로마케팅의 이면에는 소비자들이 건강한 선택을 하고 있다는 착각을 일으킬 수 있는 위험이 존재해요. 제로 식품이라고 해서 무조건 건강한 것은 아니에요. 제로 음료를 과도하게 섭취하면 인공감미료의 부작용을 경험할 수 있으며, 이는 오히려 건강에 해로울 수 있어요. 따라서 제로 제품을 선택할 때는 항상 성분표를 확인하고, 인공감미료의 종류와 함량을 체크하는 것이 중요해요. 그리고 제로 음료나 식품을 섭취하더라도 균형 잡힌 식단과 적절한 운동을 병행해야 한답니다. 건강하게 제로 식품을 섭취하는 방법은 간단해요. 첫째, 제로 음료와 식품은 가끔 즐기는 것으로 제한하고, 과도한 섭취를 피해야 해요. 둘째, 다양한 영양소를 고루 섭취하는 균형 잡힌 식단을 유지하는 것이 중요해요. 셋째, 인공감미료에 대한 정보를 숙지하고, 자신에게 맞는 제품을 선택해야 해요. 제로 식품은 칼로리를 줄이는 데 도움을 줄 수 있지만, 건강한 생활을 위해서는 균형 잡힌 식습관과 함께 적절히 활용하는 것이 필요해요. 제로마케팅에 휘둘리지 않고, 현명한 소비자가 되어 건강한 삶을 지켜나가길 바라요!',
     '#제로마케팅 #헬시플레져 #제로식품',
     0,
     0,
     NULL
    ),

    ('식후 잠이 쏟아진다면 그건 바로 혈당스파이크',
     '혈당스파이크의 원인과 예방 방법',
     '2023-08-01 00:00:00',
     '이선민',
     '식후에 갑작스러운 졸음이 몰려온다면 그것은 혈당스파이크 때문일 수 있어요. 혈당스파이크란 식사 후 혈당 수치가 급격히 상승하는 현상을 말해요. 이런 현상이 반복되면 건강에 많은 문제를 일으킬 수 있답니다. 그렇다면 혈당스파이크가 무엇인지, 왜 위험하며 어떻게 예방할 수 있는지 알아보아요. 혈당스파이크는 식사 후 혈당 수치가 갑자기 급격히 오르는 현상을 의미해요. 이는 주로 고탄수화물 음식이나 단 음식 섭취 후 발생하며, 인슐린이 급격히 분비되어 혈당을 낮추려다 보니 오히려 혈당이 너무 낮아지는 저혈당 상태를 초래할 수 있어요. 이렇게 혈당이 급격히 오르내리면 몸은 피로를 느끼고, 졸음이 쏟아지는 것이죠. 뿐만 아니라, 장기적으로는 인슐린 저항성이 생겨 당뇨병 위험이 높아지고, 심혈관 질환 등의 다양한 건강 문제가 발생할 수 있어요. 혈당스파이크가 위험한 이유는 여러 가지가 있어요. 혈당의 급격한 변화: 혈당이 급격히 상승하고 하락하는 과정에서 몸이 큰 스트레스를 받아요. 이는 만성 피로를 유발하고, 집중력 저하로 이어질 수 있어요. 인슐린 저항성 증가: 반복적인 혈당스파이크는 인슐린 저항성을 증가시켜 제2형 당뇨병의 위험을 높여요. 체중 증가와 비만: 혈당 변동이 심하면 체중 증가와 비만을 초래할 수 있으며, 이는 심혈관 질환과 같은 심각한 건강 문제로 이어질 수 있어요. 혈당스파이크를 예방하는 방법도 중요해요. 다음과 같은 방법을 통해 혈당스파이크를 예방할 수 있답니다: 식이섬유와 단백질 섭취: 고탄수화물 음식보다는 단백질과 식이섬유가 풍부한 음식을 함께 섭취하는 것이 좋아요. 이렇게 하면 혈당 상승을 완만하게 조절할 수 있어요. 규칙적인 식사: 규칙적인 식사와 간식을 통해 혈당 수치를 안정적으로 유지하는 것이 중요해요. 식사 후 운동: 식사 후에는 가벼운 운동을 하는 것이 좋아요. 걷기나 스트레칭 같은 간단한 운동은 혈당 조절에 도움이 돼요. 천천히 씹어 먹기: 음식을 천천히 씹어 먹는 것도 좋은 방법이에요. 이렇게 하면 소화 과정이 천천히 이루어져 혈당 상승이 완만하게 되죠. 건강한 생활 습관을 유지하면서 혈당스파이크를 예방하는 것이 중요해요. 올바른 식습관과 규칙적인 운동을 통해 혈당을 안정적으로 관리하고, 장기적인 건강을 지켜나가길 바라요. 혈당스파이크에 대해 잘 이해하고 실천한다면, 식후에도 활기차고 건강한 생활을 할 수 있답니다.',
     '#혈당 #생활 #건강',
     0,
     0,
     NULL
    ),

    ('당뇨 예방, 바로 지금이야',
     '당뇨병의 위험성과 예방 방법',
     '2023-08-01 00:00:00',
     '이재영',
     '당뇨병은 흔히 들을 수 있는 질병이지만, 그 심각성과 예방의 중요성을 간과하기 쉬워요. 당뇨병은 혈당 수치가 비정상적으로 높아지는 질병으로, 인슐린이라는 호르몬이 제대로 작용하지 않거나 부족할 때 발생해요. 당뇨병은 제1형 당뇨병과 제2형 당뇨병으로 나뉘어요. 제1형 당뇨병은 주로 어린 시절이나 청소년기에 발병하며, 몸에서 인슐린을 거의 생산하지 못해요. 반면, 제2형 당뇨병은 주로 성인에게서 발생하며, 인슐린 저항성이 높아지거나 인슐린 생산이 감소하여 생겨요. 당뇨병은 적절한 관리가 이루어지지 않으면 심각한 건강 문제를 야기할 수 있어요. 그렇기 때문에 조기 예방과 관리는 매우 중요합니다. 당뇨병 예방은 건강한 삶을 위한 필수적인 요소예요. 당뇨병을 방치하면 심장병, 신장 질환, 시력 손상 등 다양한 합병증으로 이어질 수 있으며, 이는 삶의 질을 크게 저하시킬 뿐만 아니라 막대한 의료비용을 초래해요. 특히, 혈당스파이크를 예방하는 방법도 중요해요. 다음과 같은 방법을 통해 혈당스파이크를 예방할 수 있어요. 식이섬유와 단백질 섭취: 고탄수화물 음식보다는 단백질과 식이섬유가 풍부한 음식을 함께 섭취하는 것이 좋아요. 이렇게 하면 혈당 상승을 완만하게 조절할 수 있답니다. 규칙적인 식사: 규칙적인 식사와 간식을 통해 혈당 수치를 안정적으로 유지하는 것이 중요해요. 식사 후 운동: 식사 후에는 가벼운 운동을 하는 것이 좋아요. 걷기나 스트레칭 같은 간단한 운동은 혈당 조절에 도움이 됩니다. 천천히 씹어 먹기: 음식을 천천히 씹어 먹는 것도 좋은 방법이에요. 이렇게 하면 소화 과정이 천천히 이루어져 혈당을 완만하게 상승시킬 수 있어요. 이러한 방법들을 실천하면 혈당스파이크를 예방하고, 건강한 혈당 수치를 유지하는 데 큰 도움이 돼요. 또한, 정기적인 건강 검진을 통해 혈당 수치를 체크하는 것도 중요합니다. 특히, 가족 중에 당뇨병 환자가 있거나, 고혈압, 고지혈증 등의 위험 요인이 있는 경우 더욱 주의가 필요해요. 조기 발견을 통해 당뇨병을 효과적으로 관리할 수 있으며, 이는 합병증을 예방하는 데 큰 도움이 돼요. 당뇨병 예방은 일찍 시작할수록 좋아요. 작은 습관의 변화로 나의 건강을 지킬 수 있답니다. 건강한 생활 습관을 유지하고, 정기적인 검진을 통해 조기 발견과 관리를 실천함으로써 당뇨병으로부터 자유로운 삶을 누리시길 바라요!',
     '#당뇨병 #건강 #정보',
     0,
     0,
     NULL
    );

-- Product 테이블 데이터 삽입
INSERT INTO product (product_name, product_ml, product_description, carbohydrate_g, sugar_g, protein_g, fat_g, saturated_fat_g, trans_fat_g, cholesterol_g, sodium_g, likes, stars, reviews, views, product_category, thumbnail) VALUES
    ('펩시 제로슈거 라임향 제로카페인', 355, '정제수, 아세설팜칼륨, 아스파탐, 구연산, 구연산칼륨, 인산, 아세설팜칼륨, 피로인산제이철, 아세설팜칼륨, 아스파탐, 수크랄로스, 향료(합성착향료), L-아르기닌, 이소말트울로스, 중쇄중성지방산화유(MCT)', 0, 0, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 'CARBONATED_DRINKS', null);
-- ProductSweetener 테이블 데이터 삽입
INSERT INTO product_sweetener (product_id, sweetener_id) VALUES
                                                             ((SELECT product_id FROM product WHERE product_name = '펩시 제로슈거 라임향 제로카페인'), (SELECT sweetener_id FROM sweetener WHERE sweetener_name = '아세설팜칼륨')),
                                                             ((SELECT product_id FROM product WHERE product_name = '펩시 제로슈거 라임향 제로카페인'), (SELECT sweetener_id FROM sweetener WHERE sweetener_name = '아스파탐')),
                                                             ((SELECT product_id FROM product WHERE product_name = '펩시 제로슈거 라임향 제로카페인'), (SELECT sweetener_id FROM sweetener WHERE sweetener_name = '수크랄로스'));



INSERT INTO product_sweetener (product_id, sweetener_id) VALUES
                                                             (1, 3),
                                                             (1, 4),
                                                             (1, 1),
                                                             (2, 5),
                                                             (2, 3),
                                                             (2, 1),
                                                             (3, 3),
                                                             (3, 1),
                                                             (4, 1),
                                                             (4, 3),
                                                             (5, 1),
                                                             (5, 3),
                                                             (6, 1),
                                                             (6, 3),
                                                             (7, 1),
                                                             (7, 3),
                                                             (8, 1),
                                                             (8, 3),
                                                             (9, 5),
                                                             (9, 3),
                                                             (9, 1),
                                                             (10, 1),
                                                             (10, 3),
                                                             (11, 3),
                                                             (11, 1),
                                                             (12, 3),
                                                             (12, 1),
                                                             (13, 4),
                                                             (13, 3),
                                                             (13, 1),
                                                             (14, 3),
                                                             (14, 1),
                                                             (15, 5),
                                                             (15, 3),
                                                             (15, 1),
                                                             (16, 1),
                                                             (16, 3),
                                                             (17, 1),
                                                             (17, 3),
                                                             (18, 1),
                                                             (18, 3),
                                                             (19, 1),
                                                             (19, 3),
                                                             (20, 1),
                                                             (20, 3);
